
&НаКлиенте
Процедура ПолучитьДокументы(Команда)
	ТакДанные = Элементы.Список.ТекущиеДанные;
	Если Не ТакДанные = Неопределено Тогда		
		РезультатВыполнения = ПроверитьНаличиеДокументаВоВнешнейБазеСервер(ТакДанные.Ссылка);
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Ложь;
	 	ПараметрыОжидания.Интервал = 2;	    
	    ДлительныеОперацииКлиент.ОжидатьЗавершение(
	        РезультатВыполнения,
	        Новый ОписаниеОповещения("ОбработатьПолучениеДанныхОНаличииДокументаВоВнешнейБД", ЭтотОбъект),
	        ПараметрыОжидания);				
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьНаличиеДокументаВоВнешнейБазеСервер(СсылкаСчет)
			
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);	
	ИдентификаторЗадания = Неопределено;
	
	СтруктураПараметровПроцедуры = Новый Структура;	
	СтруктураПараметровПроцедуры.Вставить("СсылкаСчет", СсылкаСчет);
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда		
		АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
		// здесь должен быть вызов нашей процедуры
		РезультатВыполнения = Новый Структура("ЗаданиеВыполнено", Истина);
		
	Иначе
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
    	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Проверить наличие документа Счет во внешней БД'");		
		
		РезультатВыполнения  = ДлительныеОперации.ВыполнитьВФоне( 
		"УправлениеДокументамиСервер.ПроверитьНаличиеСформированногоДокументаВоВнешнейБД", 
		СтруктураПараметровПроцедуры, 
		ПараметрыВыполнения);	

	КонецЕсли;
		
	Возврат РезультатВыполнения;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьПолучениеДанныхОНаличииДокументаВоВнешнейБД(Результат, ДополнительныеПараметры) Экспорт
	Если Результат.Статус = "Ошибка" Тогда
		Сообщить(Результат.ПодробноеПредставлениеОшибки);
		Возврат
	КонецЕсли;
	стрПараметры = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);	
	//стрПараметры.Вставить("булДокументыСформированы", УправлениеДокументамиСервер.ПроверитьНаличиеСформированногоДокументаВоВнешнейБД(ТакДанные.Ссылка));
	ОткрытьФорму("Документ.СчетПокупателя.Форма.ФормаСписокГенерированныхДокументов", стрПараметры, ЭтаФорма, УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура СерверДобавитьВПроектНаСервере(ссылкаСчет, ссылкаПроект)
	ОбъектСчет = ссылкаСчет.ПолучитьОбъект();
	ОбъектСчет.Проект = ссылкаПроект;
	ОбъектСчет.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВПроект(Команда)
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("КлиентОбработатьВыборПроектяДляДобавленияКСчету", ЭтотОбъект, Новый Структура("СсылкаСчет", ТекСтрока.Ссылка));
	Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	стрПараметры = Новый Структура;
	Отбор = Новый Структура("Контрагент", ТекСтрока.Контрагент);
	стрПараметры.Вставить("Отбор", Отбор);
	ОткрытьФорму("Справочник.Проекты.ФормаВыбора",стрПараметры,ЭтаФорма,,,,Оповещение,Режим);
	
	//ДобавитьВПроектНаСервере(ТекСтрока.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура КлиентОбработатьВыборПроектяДляДобавленияКСчету(Результат, ДополнительнаяИнформация) Экспорт 
	Если Результат = Неопределено ТОгда
		Возврат
	КонецЕсли;	
	СерверДобавитьВПроектНаСервере(ДополнительнаяИнформация.СсылкаСчет, Результат);
	Элементы.Список.Обновить();
КонецПроцедуры // КлиентОбработатьВыборПроектяДляДобавленияКСчету()
