
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗаписьНаФормеПроекта" Тогда
		Элементы.СписокПроектов.Обновить();		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокПроектов.Параметры.УстановитьЗначениеПараметра("Куратор", ПараметрыСеанса.ТекущийПользователь.Сотрудник);
	СписокПроектов.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
КонецПроцедуры

&НаКлиенте

&НаКлиенте
Процедура ОткрытьДетализациюПОПроекту(Команда)
	стрОтбор = Новый Структура("Проект", Элементы.СписокПроектов.ТекущиеДанные.Ссылка);
	стрПараметры = Новый Структура("Отбор, СформироватьПриОткрытии", стрОтбор, Истина);
	ОткрытьФорму("Отчет.РентабельностьПоПроекту.Форма", стрПараметры, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СчетПокупателя(Команда)
	ОткрытьФорму("Документ.СчетПокупателя.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПроект(Команда)
	ОткрытьФорму("Справочник.Проекты.ФормаОбъекта");
КонецПроцедуры
