Функция ПолучитьМассивСотрудников() Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Сотрудники.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.Сотрудники КАК Сотрудники
	               |ГДЕ
	               |	НЕ Сотрудники.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Наименование";
	ТЗДанные = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗДанные.ВыгрузитьКолонку("Наименование");
КонецФункции // ПолучитьМассивСотрудников()

Функция ПолучитьМассивДоступныхПроектов(СсылкаСотрудник) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СотрудникиПроекты.Проект КАК Проект
	               |ИЗ
	               |	Справочник.Сотрудники.Проекты КАК СотрудникиПроекты
	               |ГДЕ
	               |	СотрудникиПроекты.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СотрудникиПроекты.Проект";
	Запрос.УстановитьПараметр("Ссылка", СсылкаСотрудник);
	ТЗДанные = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗДанные.ВыгрузитьКолонку("Проект");	
КонецФункции