
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.НомерFM.Доступность = ОбщегоНазначенияПовтИсп.ПроверитьДоступностьРоли("ПолныеПрава");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоИНННаСервере()
	стрРеквизиты = IT_СервисДанныхЕдиныхГосРеестров.РеквизитыЮрЛицаПоИНН(Объект.ИНН);
	Если стрРеквизиты.ОписаниеОшибки = Неопределено Тогда
	 Объект.КПП = стрРеквизиты.КПП; 
	 Объект.ЮридическийАдрес = стрРеквизиты.ЮридическийАдрес.Представление;
	 Объект.Наименование = стрРеквизиты.Наименование;
	 Объект.ПолноеНаименование = стрРеквизиты.НаименованиеПолное;
	Иначе
		Сообщить(стрРеквизиты.ОписаниеОшибки);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоИНН(Команда)
	Если ПустаяСтрока(Объект.ИНН) Тогда
		Сообщить("Не заполнен ИНН");
		Возврат;
	КонецЕсли;
	ЗаполнитьПоИНННаСервере();
КонецПроцедуры
