
&НаКлиенте
Процедура Отправить(Команда)
	Перем ЗначениеВозврата;
	МассивПолучателей = Новый Массив;
	Для Каждого Получатель ИЗ СписокПолучателей Цикл 
		Если Не ПустаяСтрока(Получатель.Значение) Тогда
			МассивПолучателей.Добавить(Получатель.Значение);	
		КонецЕсли;
	КонецЦикла;
	Если МассивПолучателей.Количество() > 0 Тогда 
		ЗначениеВозврата = МассивПолучателей;	
	КонецЕсли;
	Закрыть(ЗначениеВозврата);
КонецПроцедуры

&НаСервере
Процедура ДобвитьПочтовыйАдресСервер(СтрокаПочтовыйАдрес)
	Если Найти(СтрокаПочтовыйАдрес, "@") > 0 Тогда
		РаботаСЭлектроннойПочтойСервер.ДобавитьПочтовыАдресВБазу(СтрокаПочтовыйАдрес);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПолучателейЗначениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ДобвитьПочтовыйАдресСервер(Текст);
КонецПроцедуры
