
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПрибыльПоПроектам Приход
	ТаблицаТоваров = ПодготовитьТаблицуТоваровДляПроыедения(); 
	Движения.ПрибыльПоПроектам.Записывать = Истина;
	//Движение = Движения.ПрибыльПоПроектам.Добавить();
	//Движения.ПрибыльПоПроектам.ДобавитьРасход();
	Движения.ПрибыльПоПроектам.Загрузить(ТаблицаТоваров);
	
	//
	//Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//Движение.Период = Дата;
	//Движение.Проект = Проект;
	//Движение.СтатьяЗатрат = Статья;
	//Движение.Сумма = СуммаДокумента;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента = Товары.Итог("Сумма");
КонецПроцедуры

Функция ПодготовитьТаблицуТоваровДляПроыедения()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СчетПоставщикаТовары.Проект,
	               |	СчетПоставщикаТовары.Ссылка.Статья КАК СтатьяЗатрат,
	               |	СУММА(СчетПоставщикаТовары.Сумма) КАК Сумма
	               |ИЗ
	               |	Документ.СчетПоставщика.Товары КАК СчетПоставщикаТовары
	               |ГДЕ
	               |	СчетПоставщикаТовары.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СчетПоставщикаТовары.Ссылка.Статья,
	               |	СчетПоставщикаТовары.Проект";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	ТЗ.Колонки.Добавить("Период");
	ТЗ.Колонки.Добавить("ВидДвижения");
	
	ТЗ.ЗаполнитьЗначения(Дата, "Период");
	ТЗ.ЗаполнитьЗначения(ВидДвиженияНакопления.Расход, "ВидДвижения");   
	
	Возврат ТЗ;
				   
КонецФункции

Процедура ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения)
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,,"Контрагент, Номер, Дата");
	Для Каждого СтрокаТовар ИЗ ДанныеЗаполнения.Товары Цикл 
		НовыйТовар = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйТовар, СтрокаТовар);
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетПокупателя") Тогда
		ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Проекты") Тогда
 	    ЗаполнениеДокументовСервер.ЗаполнитьОбъектПоПроекту(ЭтотОбъект, ДанныеЗаполнения);
		ЭтотОбъект.Контрагент = Неопределено;
		ЭтотОбъект.Статья = Справочники.СтатьиЗатрат.Материалы;
	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	НомерВходящегоДокумента = Неопределено;
	ДатаВходящегоДокумента = Неопределено;
КонецПроцедуры
