Функция ПолучитьТаблицуПользователейДляPushУведомлений() Экспорт 
	Запрос = НОвый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	МП_ВнешниеУстройства.Пользователь КАК Пользователь,
	//               |	МП_ВнешниеУстройства.ИДPush КАК ИДPush,
	//               |	МП_ВнешниеУстройства.Пользователь.Сотрудник.АдресЭлектроннойПочты КАК ПользовательСотрудникАдресЭлектроннойПочты,
	//               |	МП_ВнешниеУстройства.Пользователь.Сотрудник.МобильныйТелефон КАК ПользовательСотрудникМобильныйТелефон,
	//               |	МП_ВнешниеУстройства.Пользователь.Сотрудник.ИзвещатьПоСМС КАК ПользовательСотрудникИзвещатьПоСМС,
	//               |	МП_ВнешниеУстройства.Ссылка КАК Устройство
	//               |ИЗ
	//               |	Справочник.МП_ВнешниеУстройства КАК МП_ВнешниеУстройства
	//               |ГДЕ
	//               |	НЕ МП_ВнешниеУстройства.ИДPush = """"
	//               |	И НЕ МП_ВнешниеУстройства.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяССылка)";
	Запрос.Текст = "ВЫБРАТЬ
	               |	Пользователи.Ссылка КАК Пользователь,
	               |	Пользователи.ТелеграмИД КАК ТелеграмИД,
	               |	Пользователи.Сотрудник.АдресЭлектроннойПочты КАК ПользовательСотрудникАдресЭлектроннойПочты,
	               |	Пользователи.Сотрудник.МобильныйТелефон КАК ПользовательСотрудникМобильныйТелефон,
	               |	Пользователи.Сотрудник.ИзвещатьПоСМС КАК ПользовательСотрудникИзвещатьПоСМС
	               |ИЗ
	               |	Справочник.Пользователи КАК Пользователи
	               |ГДЕ
	               |	Пользователи.ТелеграмИД > 0
	               |	И НЕ Пользователи.ПометкаУдаления";
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьДовереностьПользователя(Сотрудник, Организация) Экспорт 
	Перем ЗначениеВозврата;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СотрудникиДоверенности.Доверенность КАК Доверенность
	               |ИЗ
	               |	Справочник.Сотрудники.Доверенности КАК СотрудникиДоверенности
	               |ГДЕ
	               |	СотрудникиДоверенности.Ссылка = &Сотрудник
	               |	И СотрудникиДоверенности.Организация = &Организация";
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник); 				   
	Запрос.УстановитьПараметр("Организация", Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		ЗначениеВозврата = Выборка.Доверенность;	
	КонецЕсли;
	
	Возврат ЗначениеВозврата;
КонецФункции