Функция СоздатьЗадачуДляПользователя(стрПараметры) Экспорт 
	НовоеНапоминание = Задачи.ЗадачиПользователя.СоздатьЗадачу();
	НовоеНапоминание.Дата = ТекущаяДата();
	НовоеНапоминание.Исполнитель = стрПараметры.Исполнитель;
	НовоеНапоминание.Куратор = стрПараметры.Автор;	
	//НовоеНапоминание.Комментарий = стрПараметры.Комментарий;
	НовоеНапоминание.Наименование = стрПараметры.Комментарий;
	НовоеНапоминание.СрокНапоминания = ТекущаяДата();
	НовоеНапоминание.ВремяВыполнения = ТекущаяДата() + 3600 * 24 * стрПараметры.СрокВыполнения;
	
	НовоеНапоминание.Записать();
	Возврат НовоеНапоминание.Ссылка;
КонецФункции

Функция ПолучитьМассивЗадачПользователя(Пользователь) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗадачиПользователя.Ссылка КАК Ссылка,
	               |	ЗадачиПользователя.Наименование КАК Наименование,
	               |	ЗадачиПользователя.ВремяВыполнения КАК ВремяВыполнения,
	               |	ЗадачиПользователя.Номер КАК Номер
	               |ИЗ
	               |	Задача.ЗадачиПользователя КАК ЗадачиПользователя
	               |ГДЕ
	               |	Не ЗадачиПользователя.Выполнена
	               |	И ЗадачиПользователя.Исполнитель = &Исполнитель
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВремяВыполнения";
	Запрос.УстановитьПараметр("Исполнитель", Пользователь);
	Выборка = Запрос.Выполнить().Выбрать();
	МассивРезультат = Новый Массив;
	Пока Выборка.Следующий() Цикл 		
		МассивРезультат.Добавить(Выборка.Номер + "--" + Выборка.Наименование + "(" + Формат(Выборка.ВремяВыполнения, "ДФ=dd.MM.yyyy") + ")");
	КонецЦикла;
	
	Возврат МассивРезультат;
КонецФункции // ПолучитьМассивЗадачПользователя(стрUpdates.Пользователь)()

Функция ПолучитьМассивЗадачКуратора(Пользователь) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗадачиПользователя.Ссылка КАК Ссылка,
	               |	ЗадачиПользователя.Наименование КАК Наименование,
	               |	ЗадачиПользователя.ВремяВыполнения КАК ВремяВыполнения,
	               |	ЗадачиПользователя.Номер КАК Номер
	               |ИЗ
	               |	Задача.ЗадачиПользователя КАК ЗадачиПользователя
	               |ГДЕ
	               |	Не ЗадачиПользователя.Выполнена
	               |	И ЗадачиПользователя.Куратор = &Исполнитель
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВремяВыполнения";
	Запрос.УстановитьПараметр("Исполнитель", Пользователь);
	Выборка = Запрос.Выполнить().Выбрать();
	МассивРезультат = Новый Массив;
	Пока Выборка.Следующий() Цикл 		
		МассивРезультат.Добавить(Выборка.Номер + "--" + Выборка.Наименование + "(" + Формат(Выборка.ВремяВыполнения, "ДФ=dd.MM.yyyy") + ")");
	КонецЦикла;
	
	Возврат МассивРезультат;
КонецФункции // ПолучитьМассивЗадачПользователя(стрUpdates.Пользователь)()
