Функция ПолучитьТЗДополнительныхПрав(СсылкаТСД) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МП_ДополнительныеПраваТСД.ПометкаУдаления,
	               |	МП_ДополнительныеПраваТСД.Ссылка КАК Право,
	               |	ЕСТЬNULL(ЗначениеДопПрава.ЗначениеПрава, ЛОЖЬ) КАК ЗначениеПрава
	               |ИЗ
	               |	Справочник.МП_ДополнительныеПраваТСД КАК МП_ДополнительныеПраваТСД
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			МП_ЗначениеПравТСД.Право КАК Право,
	               |			МП_ЗначениеПравТСД.ЗначениеПрава КАК ЗначениеПрава
	               |		ИЗ
	               |			РегистрСведений.МП_ЗначениеПравТСД КАК МП_ЗначениеПравТСД
	               |		ГДЕ
	               |			МП_ЗначениеПравТСД.Объект = &Объект) КАК ЗначениеДопПрава
	               |		ПО МП_ДополнительныеПраваТСД.Ссылка = ЗначениеДопПрава.Право
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	МП_ДополнительныеПраваТСД.Наименование";
	Запрос.УстановитьПараметр("Объект", СсылкаТСД);
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции

Функция ПолучитьЗначениеПрава(строкаПраво, СсылкаТСД) Экспорт 
	ЗначениеВозврата = Ложь;
	НаборЗаписей = РегистрыСведений.МП_ЗначениеПравТСД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Право.Установить(Справочники.МП_ДополнительныеПраваТСД[строкаПраво]);
	НаборЗаписей.Отбор.Объект.Установить(СсылкаТСД);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда 	
		ЗначениеВозврата = НаборЗаписей[0].ЗначениеПрава;			
	КонецЕсли;

	Возврат ЗначениеВозврата;
КонецФункции // ПолучитьЗначениеПрава()
