Функция ПолучитьМассивРолейПользователя(СсылкаСотрудник) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТелеграмСвязьРолейДоступа.РольДоступа.Наименование КАК РольДоступаНаименование
	               |ИЗ
	               |	РегистрСведений.ТелеграмСвязьРолейДоступа КАК ТелеграмСвязьРолейДоступа
	               |ГДЕ
	               |	ТелеграмСвязьРолейДоступа.Пользователь = &Пользователь
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТелеграмСвязьРолейДоступа.РольДоступа.Наименование";
	Запрос.УстановитьПараметр("Пользователь", СсылкаСотрудник);
	ТЗДанные = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗДанные.ВыгрузитьКолонку("РольДоступаНаименование");
КонецФункции