
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Ссылка = ПараметрКоманды;
	ИтоговаяСумма = ОбщегоНазначения.ПолучитьЗначениРеквизитаОбъекта(Ссылка, "ИтоговаяСумма");
	ПочтаПолучателя = ОбщегоНазначения.ПолучитьЗначениРеквизитаОбъекта(Ссылка, "ПочтаПолучателя"); 
	МассивДокументов = ПечатьДокументовНаСервере(Ссылка, ИтоговаяСумма);
	Для Каждого Элемент ИЗ МассивДокументов Цикл 
		Элемент.ТабДок.Автомасштаб = Истина;
		Элемент.ТабДок.Показать();	
	КонецЦикла;
	Режим = РежимДиалогаВопрос.ДаНет;
	Ответ = Вопрос("Отправить письмо с pdf файлом на адрес " + ПочтаПолучателя, Режим, 0);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
	    Возврат;
	КонецЕсли;
	//ИмяИтоговогоФайла = СклеитьМассивPDFДокументовВОдин(МассивДокументов);
	//АдресФайл = ""; 
	//ПоместитьФайл(АдресФайл, ИмяИтоговогоФайла,,Ложь, УникальныйИдентификатор);
	//УдалитьФайлы(ИмяИтоговогоФайла);
	ОтправитьПисьмоСВложением(МассивДокументов, ПочтаПолучателя);
	
	
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

&НаСервере
Функция ОтправитьПисьмоСВложением(МассивДокументов, Получатель) Экспорт 
	стрВложение = Новый Соответствие();
	Для Каждого Элемент ИЗ МассивДокументов Цикл                                          
		ИмяВремФайла = ПолучитьИмяВременногоФайла("pdf");
		Элемент.ТабДок.Записать(ИмяВремФайла, ТипФайлаТабличногоДокумента.PDF);
		стрВложение.Вставить(Элемент.ИмяМакета + ".pdf", Новый ДвоичныеДанные(ИмяВремФайла));
	КонецЦикла;
	Разделитель = ",";
	Если Найти(Получатель, ";") > 0 Тогда 
		Разделитель = ";";
	КонецЕсли;
	МассивПолучателей = СтрРазделить(Получатель, Разделитель);
	РаботаСЭлектроннойПочтойСервер.ОтправитьПочтовоеСообщение("ТЗ",, МассивПолучателей, "sev@gks-service.ru", стрВложение); 
КонецФункции // СклеитьМассивPDFДокументовВОдин(

&НаСервере
Функция ПечатьДокументовНаСервере(Ссылка, ИтоговаяСумма)	
	 Возврат Документы.ЗаявкаНаТендер.СформироватьПечатныеФормыДокументов(Ссылка, ИтоговаяСумма);
КонецФункции
