Функция СоздатьДокументПрограммно(стрПараметры) Экспорт 
	НовыйДокумент = Документы.ВыплатаНачислений.СоздатьДокумент();
	НовыйДокумент.Дата = ТекущаяДата();
	//НовыйДокумент.Изменил = стрПараметры.Автор;
	НовыйДокумент.Комментарий = стрПараметры.Комментарий;
	НовыйДокумент.Изменил = стрПараметры.Автор;
	НоваяСтрокаСотрудник = НовыйДокумент.Сотрудники.Добавить();
	НоваяСтрокаСотрудник.Сотрудник = стрПараметры.Сотрудник;
	НоваяСтрокаСотрудник.Комментарий = стрПараметры.Комментарий;
	НоваяСтрокаСотрудник.Сумма = стрПараметры.Сумма;
	
	НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат НовыйДокумент.Ссылка;
КонецФункции // СоздатьДокумент()
