
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	стрПараметры = Новый Структура;
	стрПараметры.Вставить("Наименование", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '""%1"" требует внимания'"), ПараметрКоманды));
	стрПараметры.Вставить("СрокНапоминания", ТекущаяДата() + 3600 * 24);
	стрПараметры.Вставить("ВремяВыполнения", ТекущаяДата() + 3600 * 24);
	стрПараметры.Вставить("Объект", ПараметрКоманды);
	стрПараметры.Вставить("Исполнитель", ОбщегоНазначенияПовтИсп.ПолучитьЗначениеПараметраСеанса("ТекущийПользователь"));
	стрПараметры.Вставить("Куратор", ОбщегоНазначенияПовтИсп.ПолучитьЗначениеПараметраСеанса("ТекущийПользователь"));

	РаботаСНапоминаниямиКлиент.НапомнитьВУказанноеВремя(стрПараметры);
		
	Состояние(НСтр("ru = 'Напоминание добавлено'"));
КонецПроцедуры
