
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьначенияДополнительныхПрав();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьначенияДополнительныхПрав()
	ТЗ = Справочники.МП_ВнешниеУстройства.ПолучитьТЗДополнительныхПрав(Объект.Ссылка);
	ТаблицаДополнительныйПрава.Загрузить(ТЗ);	
КонецПроцедуры // ЗаполнитьТаблицуДопПрав()

&НаСервере
Процедура ЗаписатьЗначенияДопПравСервер()
	ТЗ = РеквизитФормыВЗначение("ТаблицаДополнительныйПрава", Тип("ТаблицаЗначений"));
	НаборЗаписей = РегистрыСведений.МП_ЗначениеПравТСД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Объект.Ссылка);
	Для Каждого СтрокаСвойство ИЗ ТЗ Цикл 
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Объект = Объект.Ссылка;
		ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаСвойство, "Право, ЗначениеПрава");
	КонецЦикла;
	НаборЗаписей.Записать();
КонецПроцедуры // ЗаполнитьТаблицуДопПрав()

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	//ЗаписатьЗначенияДопПравСервер();
КонецПроцедуры

&НаСервере
Функция ОтправитьPushСообщениеНаСервере(Сообщение)
	стрПараметры = Новый Структура;
	стрПараметры.Вставить("ТекстСообщения", Сообщение);
	стрПараметры.Вставить("Заголовок", "testmessage");
	Возврат ИнтеграцияСВнешнимиСистемамиСервер.ОтправитьPushСообщение(Объект.Ссылка,стрПараметры); 	
КонецФункции

&НаКлиенте
Процедура ОтправитьPushСообщение(Команда)
	Перем Сообщение;
	Если Объект.Ссылка.Пустая() Тогда
		Сообщить("Перед отправкой необходимо записать элемент!");
		Возврат
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ИДPush) Тогда
		Сообщить("Не заполнен идентификатор(ИДPush) устройства для отправки push сообщений!");
		Возврат
	КонецЕсли;
	Если ВвестиСтроку(Сообщение, "Введите сообщение для отправки") Тогда
		Результат = ОтправитьPushСообщениеНаСервере(Сообщение);
		Если Результат Тогда
			Сообщить("Сообщение успешно отправлено!");
		Иначе
			Сообщить("Не удалось отправить сообщение!");
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры
