Функция  ОтправитьСМССообщение(Сообщение, Получатель, СсылкаДок = Неопределено, ИмяОтправителя = Неопределено) Экспорт 
	//версия мир смс
	//Профиль 						= Новый ИнтернетПочтовыйПрофиль;
	//Профиль.АутентификацияSMTP 	= СпособSMTPАутентификации.Plain;
	//Профиль.АдресСервераSMTP 		= "web.mirsms.ru";
	//Профиль.ПортSMTP 				= 2525;
	//Профиль.ПользовательSMTP 		= "36000";
	//Профиль.ПарольSMTP 				= "42129361";	
	//ПочтовоеСообщение 				= Новый ИнтернетПочтовоеСообщение;
	//ПолучательСМС					= "8" + Получатель + "@web.mirsms.ru"; 	
	//ПочтовоеСообщение.Получатели.Добавить(ПолучательСМС);
	//ПочтовоеСообщение.Отправитель 	= "default@web.mirsms.ru";
	//ПочтовоеСообщение.Тема 			= "Интернет-заказ";
	//ПочтовоеСообщение.Тексты.Добавить(Сообщение);	
	//Почта 							= Новый ИнтернетПочта;	
	//Попытка
	//	Почта.Подключиться(Профиль);
	//	Почта.Послать(ПочтовоеСообщение);
	//Исключение
	//	Сообщить(ОписаниеОшибки());
	//	Возврат Ложь;
	//КонецПопытки;   	
	//Почта.Отключиться();
	//Если Не СсылкаДок = Неопределено Тогда
	//	НаборЗаписей = РегистрыСведений.НЦ_СМС.СоздатьНаборЗаписей();
	//	НаборЗаписей.Отбор.Документ.Установить(СсылкаДок);
	//	Запись = НаборЗаписей.Добавить();
	//	Запись.Документ		 = СсылкаДок;
	//	Запись.НомерТелефона = Получатель;
	//	Запись.Дата 		 = ТекущаяДата();
	//	НаборЗаписей.Записать(); 		
	//КонецЕсли;
	//Возврат Истина;
	
	//версия смс голд
	//Соединение = Новый HTTPСоединение("web.smsgold.ru");
	//HTTPЗапрос = Новый HTTPЗапрос;
	//HTTPЗапрос.АдресРесурса = "/http2/";
	//HTTPЗапрос.Заголовки.Вставить("Content-Type","application/x-www-form-urlencoded");
	//HTTPЗапрос.УстановитьТелоИзСтроки("action=send&user=10637.1&pass=010413038&number="+Получатель+"&text="+Сообщение,КодировкаТекста.UTF8,ИспользованиеByteOrderMark.НеИспользовать);
	//
	//Попытка
	//	Ответ = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	//	Если ТипЗнч(Ответ) = Тип("HTTPОтвет") Тогда
	//		Если НЕ Ответ.КодСостояния=200 Тогда
	//			Ошибка	= "Код="+Ответ.КодСостояния+Символы.ПС+ЗначениеВСтрокуВнутр(Ответ.Заголовки);
	//			Успешно =  Ложь;
	//		КонецЕсли;
	//	Иначе
	//		Ошибка = "В результате отправки смс вернулся неправильный ответ";
	//		Успешно =  Ложь;
	//	КонецЕсли;	
	//Исключение
	//	Ошибка = "Не удалось отправить СМС"+Символы.ПС+ОписаниеОшибки();
	//	Успешно =  Ложь;
	//КонецПопытки;	

	Успешно		= Истина;
	Получатель	= "7" + Получатель;	
	Если СтрДлина(Сообщение)>399 Тогда
		РаботаСЭлектроннойПочтойСервер.ОтправитьПисьмоОбОшибке("Рассылка СМС", "Длина сообщения превысила максимальную"+Символы.ПС+Сообщение+Символы.ПС+Получатель);
		Сообщение = ЛЕВ(Сообщение,399);
	КонецЕсли;
	ИмяОтправителяСтрока = "";
	Если Не ИмяОтправителя = Неопределено Тогда
		ИмяОтправителяСтрока = ИмяОтправителя;
	КонецЕсли;		
	СтрокаЗапрос = "user=snail&pwd=snail493715&dadr=" + Получатель + "&text=" + Сообщение + "&sadr=" + ИмяОтправителяСтрока;
	СтруктураЗаголовков = Новый Соответствие;
	СтруктураЗаголовков.Вставить("Content-Type","application/x-www-form-urlencoded");
	ОтветСервера = ИнтеграцияСВнешнимиСистемамиСервер.ПолучитьДанныеССервера("GET","gt.smsgold.ru", "/sendsms.php?" + СтрокаЗапрос, Ложь,,СтруктураЗаголовков,,,);
	
	//ОтветСервера = ИнтеграцияСВнешнимиСистемамиСервер.ПолучитьДанныеССервера("POST","web.smsgold.ru", "/http2/",ЛОЖЬ,СтрокаЗапрос,СтруктураЗаголовков,,,);
	
	Если ОтветСервера = Неопределено Тогда
		Успешно = Ложь;
	   	ТекстОшибки = "Не удалось обратиться к серверу web.smsgold.ru. Вернулся ответ Неопределено"+Символы.ПС+Сообщение+Символы.ПС+Получатель;
		
	ИначеЕсли Найти(ОтветСервера,"err")<>0 Тогда	
		XDTOОтвета = ОбъектXDTOИзXMLСтроки(ОтветСервера);
		Попытка
			Если СтрДлина(СОКРЛП(XDTOОтвета.xml_result.err))>0 Тогда
				Успешно = Ложь;
				ТекстОшибки = "Ошибка отправки смс:"+XDTOОтвета.xml_result.err+Символы.ПС+ОтветСервера+Символы.ПС+Сообщение+Символы.ПС+Получатель;
			КонецЕсли;	
		Исключение
			Успешно = Ложь;
			ТекстОшибки = "Ответ сервера не содержит информации по ошибке (поле xml_result.err):"+Символы.ПС+ОтветСервера+Символы.ПС+Сообщение+Символы.ПС+Получатель;			
		КонецПопытки;	
	КонецЕсли;	  		

		
	Если НЕ Успешно Тогда
		РаботаСЭлектроннойПочтойСервер.ОтправитьПисьмоОбОшибке("Ошибка отправки СМС", ТекстОшибки);
		Возврат Успешно;
	КонецЕсли;	
	 
	Если Не СсылкаДок = Неопределено Тогда
		НаборЗаписей = РегистрыСведений.НЦ_СМС.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(СсылкаДок);
		Запись = НаборЗаписей.Добавить();
		Запись.Документ		 = СсылкаДок;
		Запись.НомерТелефона = Получатель;
		Запись.Дата 		 = ТекущаяДата();
		НаборЗаписей.Записать();  		
	КонецЕсли;
	
	Возврат Успешно;  
КонецФункции

//преобразует строку XML в объект XDTO
Функция ОбъектXDTOИзXMLСтроки(строкаXML, СтрокаСообщения = "") Экспорт 
	Чтение=Новый ЧтениеXML;
	Чтение.УстановитьСтроку(строкаXML);   
	Фабрика=Новый ФабрикаXDTO;
	Попытка 
		ОбXDTO = Фабрика.ПрочитатьXML(Чтение);	
	Исключение	
		Сообщить("Ошибка преобразование строки XML в XDTO объект" + Символы.ПС + ОписаниеОшибки() + Символы.ПС + строкаXML);
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ОбXDTO; 
	
КонецФункции

Функция ПолучитьПисьма() Экспорт 
	СписокСвойствSMTP = "АдресСервераSMTP,ПортSMTP,ИспользоватьSSLSMTP,ПользовательSMTP,ТолькоЗащищеннаяАутентификацияSMTP";
		
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	Профиль.АдресСервераPOP3 = "pop.gmail.com";
	Профиль.ИспользоватьSSLPOP3 = Истина;
	Профиль.ПортPOP3 = 995;
	//Профиль.ПортSMTP = "";
	//Профиль.ИспользоватьSSLSMTP = "";
	Профиль.Пользователь = "dvr_monitor@gks-service.ru";
	//Профиль.ТолькоЗащищеннаяАутентификацияSMTP = "";
	Профиль.Пароль = "8mmvg3gX";
	//Профиль.АдресСервераSMTP = "";
	Почта = Новый ИнтернетПочта;
	Попытка
		Почта.Подключиться(Профиль, ПротоколИнтернетПочты.POP3);
	Исключение
		РаботаСЭлектроннойПочтойСервер.ОтправитьПисьмоОбОшибке("Ошибка получения почты СМС мониторинга", ОписаниеОшибки());	
	КонецПопытки;
	Сообщения = Почта.Выбрать(Ложь);
	Для Каждого Сообщение ИЗ Сообщения Цикл 
		Если Сообщение.Отправитель.Адрес  = "dvr_jks@gks-service.ru" Тогда
			Сообщить("СМС Отправлено!");
			ОтправитьСМССообщение("Движение на камере!","9219423198");
			ОтправитьСМССообщение("Движение на камере!","9817841554");
			//ОтправитьСМССообщение("Движение на камере!","9817391308");
		КонецЕсли;	
	КонецЦикла;
КонецФункции // ПолучитьПисьма()
