Функция ПолучитьМассивПроектов() Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Проекты.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.Проекты КАК Проекты
	               |ГДЕ
	               |	НЕ Проекты.ПометкаУдаления
	               |	И НЕ Проекты.Завершен
	               |	И НЕ Проекты.ЭтоГруппа
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Наименование";
	ТЗДанные = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗДанные.ВыгрузитьКолонку("Наименование");
КонецФункции // ПолучитьМассивСотрудников()