
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Организация = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеКонстанты("УПОсновнаяОрганизация");
		Объект.Оплачен = Истина;
	КонецЕсли;	
	//Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	ПолучитьДанныеПоТоваруИзFMКлиент();
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеПоТоваруИзFMКлиент() Экспорт
	РезультатВыполнения = ПолучитьТаблицуТоваровВФоне();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
 	ПараметрыОжидания.Интервал = 2;	    
    ДлительныеОперацииКлиент.ОжидатьЗавершение(
        РезультатВыполнения,
        Новый ОписаниеОповещения("ОбработатьПолучениеТаблицыТоваровКлиент", ЭтотОбъект),
        ПараметрыОжидания);		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПолучениеТаблицыТоваровКлиент(Результат, ДополнительныеПараметры) Экспорт
	ОбработатьПолучениеТаблицыТоваровСервер(Результат, ДополнительныеПараметры);
КонецПроцедуры

&НаСервере
Процедура ОбработатьПолучениеТаблицыТоваровСервер(Результат, ДополнительныеПараметры) Экспорт 
	Если Результат.Статус = "Ошибка" Тогда
		Сообщить(Результат.КраткоеПредставлениеОшибки);
		Возврат
	КонецЕсли;
	ТаблицаFM = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	ЗначениеВРеквизитФормы(ТаблицаFM, "ТаблицаТоваров");
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуТоваровВФоне()
			
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);	
	ИдентификаторЗадания = Неопределено;
	
	СтруктураПараметровПроцедуры = Новый Структура;	
	СтруктураПараметровПроцедуры.Вставить("НомерСчета", Объект.Номер);	
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		
		АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
		// здесь должен быть вызов нашей процедуры
		РезультатВыполнения = Новый Структура("ЗаданиеВыполнено", Истина);
		
	Иначе
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
    	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получить данные по товарам из FM'");		
		
		РезультатВыполнения  = ДлительныеОперации.ВыполнитьВФоне( 
		"УправлениеДокументамиСервер.ПолучитьТаблицуТоваровИзFM", 
		СтруктураПараметровПроцедуры, 
		ПараметрыВыполнения);	

	КонецЕсли;
		
	Возврат РезультатВыполнения;
	
КонецФункции

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ТекСтрока.Сумма = ТекСтрока.Цена * ТекСтрока.Количество; 
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ТекСтрока.Сумма = ТекСтрока.Цена * ТекСтрока.Количество; 
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	Режим = РежимДиалогаВопрос.ДаНет;
	Ответ = Вопрос("Изменить проект во всех строках табличной части?", Режим, 0);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
	    Возврат
	КонецЕсли; 
	
	Для Каждого СтрокаТЧ ИЗ Объект.Товары Цикл 
		СтрокаТЧ.Проект = Объект.Проект;		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	РаботаСФормамиКлиент.ОповеститьПослеЗаписиФормы("ЗаписьНаФорме", Объект.Ссылка, Новый Структура("Проект", Объект.Проект));
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.Проект) Тогда
		Элемент.ТекущиеДанные.Проект = Объект.Проект;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.Количество) Тогда
		Элемент.ТекущиеДанные.Количество = 1;
	КонецЕсли;
КонецПроцедуры
