Перем ПредыдущееЗначение;

Процедура ПриЗаписи(Отказ)
	Если ПредыдущееЗначение <> Константы.IT_ИнтернетПоддержкаПинКод.Получить() Тогда
		Отказ = НЕ IT_СервисДанныхЕдиныхГосРеестров.ЗарегистрироватьОбновитьПользователя();
		Если Отказ Тогда
			Сообщить("Не удалось активировать сервис, проверьте правильность указания данных активации");
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	ПредыдущееЗначение = Константы.IT_ИнтернетПоддержкаПинКод.Получить();
КонецПроцедуры