
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.булДокументыСформированы Тогда
		//Элементы.ГруппаСформировать.Доступность = Ложь;		
		булДокументыСформированы = Истина;
		Элементы.СформироватьДокументы.Заголовок = "Переформировать документы";
		Параметры.Свойство("Дата", ДатаДокументов);
		Если Параметры.Свойство("Файлы") Тогда 
			ПутьСчет = Параметры.Файлы.СчетНаОплату;		
			ПутьСФ = Параметры.Файлы.СчетФактураВыданный;
			стрРТУ = Параметры.Файлы.РеализацияТоваровУслуг; 
			Если стрРТУ.Свойство("Акт") Тогда
				ПутьАкт = стрРТУ.Акт;
			КонецЕсли;
			Если стрРТУ.Свойство("Торг12") Тогда
				ПутьТОРГ12 = стрРТУ.Торг12;
			КонецЕсли;		
			Элементы.СкачатьТорг12.Доступность = стрРТУ.Свойство("Торг12");
			Элементы.СкачатьАкт.Доступность = стрРТУ.Свойство("Акт"); 
			Элементы.ГруппаКомандыСкачать.Доступность = Истина;
			//Элементы.ГруппаСформировать.Доступность = Ложь;		
			
		КонецЕсли;		
	Иначе
		Элементы.ГруппаКомандыСкачать.Доступность = Ложь;
		ДатаДокументов = ТекущаяДата();
	КонецЕсли;
	СчетПокупателя = Параметры.СчетПокупателя;
	Если Не Параметры.ПоДоверенности = Неопределено Тогда
		ПоДоверенности = Истина;
	КонецЕсли;
	
	ТекСотрудник = ОбщегоНазначенияПовтИсп.ПолучитьТекущегоСотрудника(); 
	Доверенность = УправлениеПользователями.ПолучитьДовереностьПользователя(ТекСотрудник, СчетПокупателя.Организация);
	Элементы.ПоДоверенности.Доступность = ЗначениеЗаполнено(Доверенность);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокумента(Команда)
	
	РезультатВыполнения = СформироватьДокументаНаСервере();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Ложь;
 	ПараметрыОжидания.Интервал = 2;	    
    ДлительныеОперацииКлиент.ОжидатьЗавершение(
        РезультатВыполнения,
        Новый ОписаниеОповещения("ОбработатьСформироватьДокумента", ЭтотОбъект),ПараметрыОжидания);	
	//СформироватьДокументаНаСервере();
КонецПроцедуры

&НаСервере
Функция СформироватьДокументаНаСервере()
	СтруктураПараметровПроцедуры = Новый Структура;
	СтруктураПараметровПроцедуры.Вставить("СчетПокупателя", СчетПокупателя);
	СтруктураПараметровПроцедуры.Вставить("НомерСчета", СчетПокупателя.Номер);
	СтруктураПараметровПроцедуры.Вставить("Дата", ДатаДокументов);
	СтруктураПараметровПроцедуры.Вставить("ПереформироватьДокументы", булДокументыСформированы);
	СтруктураПараметровПроцедуры.Вставить("Префикс", Формат(ДатаДокументов, "ДФ=yyyyMMdd-"));
	Если ПоДоверенности Тогда 
		СотрудникПоДоверенности = ОбщегоНазначенияПовтИсп.ПолучитьТекущегоСотрудника();	
		Доверенность = УправлениеПользователями.ПолучитьДовереностьПользователя(СотрудникПоДоверенности, СчетПокупателя.Организация);
		Если Не Доверенность = Неопределено Тогда
			стрДоверенность = Новый Структура;
			стрДоверенность.Вставить("ФИОГлавногоБухгалтера", Строка(СотрудникПоДоверенности));		
			стрДоверенность.Вставить("ФИОРуководителя",  Строка(СотрудникПоДоверенности));
			стрДоверенность.Вставить("Доверенность", Доверенность);
			СтруктураПараметровПроцедуры.Вставить("ПоДоверенности", стрДоверенность);
		КонецЕсли;
	КонецЕсли;
	
	
	//УправлениеДокументамиСервер.СформироватьДокумнтыПоСчету(стрПараметры);
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);	
	ИдентификаторЗадания = Неопределено;
	
	//СтруктураПараметровПроцедуры = Новый Структура;	
	//СтруктураПараметровПроцедуры.Вставить("стрПараметры", стрПараметры);
	//Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда		
	//	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	//	// здесь должен быть вызов нашей процедуры
	//	РезультатВыполнения = Новый Структура("ЗаданиеВыполнено", Истина);
	//	
	//Иначе
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
    	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Сформировать документы во внешней БД'");		
		
		РезультатВыполнения  = ДлительныеОперации.ВыполнитьВФоне( 
		"УправлениеДокументамиСервер.СформироватьДокумнтыПоСчету", 
		СтруктураПараметровПроцедуры, 
		ПараметрыВыполнения);	

	//КонецЕсли;
		
	Возврат РезультатВыполнения;	
	
	//Если стрПараметры.Свойство("Файлы") Тогда 
	//	ПутьСчет = стрПараметры.Файлы.СчетНаОплату;		
	//	ПутьСФ = стрПараметры.Файлы.СчетФактураВыданный;
	//	стрРТУ = стрПараметры.Файлы.РеализацияТоваровУслуг; 
	//	Если стрРТУ.Свойство("Акт") Тогда
	//		ПутьАкт = стрРТУ.Акт;
	//	КонецЕсли;
	//	Если стрРТУ.Свойство("Торг12") Тогда
	//		ПутьТОРГ12 = стрРТУ.Торг12;
	//	КонецЕсли;		
	//	Элементы.СкачатьТорг12.Доступность = стрРТУ.Свойство("Торг12");
	//	Элементы.СкачатьАкт.Доступность = стрРТУ.Свойство("Акт"); 		
	//	Элементы.ГруппаКомандыСкачать.Доступность = Истина;
	//	Элементы.ГруппаСформировать.Доступность = Ложь;
	//КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ОбработатьСформироватьДокумента(Результат, ДополнительныеПараметры) Экспорт
	Если Результат.Статус = "Ошибка" Тогда
		Сообщить(Результат.ПодробноеПредставлениеОшибки);
		Возврат
	КонецЕсли;
	стрПараметры = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);	
	Если стрПараметры.Свойство("Файлы") Тогда 
		ПутьСчет = стрПараметры.Файлы.СчетНаОплату;		
		ПутьСФ = стрПараметры.Файлы.СчетФактураВыданный;
		стрРТУ = стрПараметры.Файлы.РеализацияТоваровУслуг; 
		Если стрРТУ.Свойство("Акт") Тогда
			ПутьАкт = стрРТУ.Акт;
		КонецЕсли;
		Если стрРТУ.Свойство("Торг12") Тогда
			ПутьТОРГ12 = стрРТУ.Торг12;
		КонецЕсли;		
		Элементы.СкачатьТорг12.Доступность = стрРТУ.Свойство("Торг12");
		Элементы.СкачатьАкт.Доступность = стрРТУ.Свойство("Акт"); 		
		Элементы.ГруппаКомандыСкачать.Доступность = Истина;
		булДокументыСформированы = Истина;
		Элементы.СформироватьДокументы.Заголовок = "Переформировать документы";
		Оповестить("СчетПокупателяДокументыСформированны", СчетПокупателя);
		//Элементы.ГруппаСформировать.Доступность = Ложь;
	КонецЕсли;	
	//стрПараметры.Вставить("булДокументыСформированы", УправлениеДокументамиСервер.ПроверитьНаличиеСформированногоДокументаВоВнешнейБД(ТакДанные.Ссылка));
	//ОткрытьФорму("Документ.СчетПокупателя.Форма.ФормаСписокГенерированныхДокументов", стрПараметры, ЭтаФорма, УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры

&НаКлиенте
Процедура СкачатьСчет(Команда)
	Перем АдресХранилища; 
	ПоместитьФайлВХранилищеПоСсылке(АдресХранилища, ПутьСчет);	
	ПолучитьФайл(АдресХранилища,"Счет.pdf", Истина);	
КонецПроцедуры

&НаСервере
Процедура ПоместитьФайлВХранилищеПоСсылке(АдресХранилища, ПутьФайл)	
	ДвоичныеДанные = Новый ДвоичныеДанные(ПутьФайл);
	АдресХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор); 
КонецПроцедуры

&НаКлиенте
Процедура СкачатьРТУ(Команда)
	Перем АдресХранилища; 
	ПоместитьФайлВХранилищеПоСсылке(АдресХранилища, ПутьАкт);	
	ПолучитьФайл(АдресХранилища,"Акт_ТН.pdf", Истина);
КонецПроцедуры

&НаКлиенте
Процедура СкачатьСФ(Команда)
	Перем АдресХранилища; 
	ПоместитьФайлВХранилищеПоСсылке(АдресХранилища, ПутьСФ);	
	ПолучитьФайл(АдресХранилища,"Счет-Фактура.pdf", Истина);
КонецПроцедуры

&НаКлиенте
Процедура СкачатьТорг12(Команда)
	Перем АдресХранилища; 
	ПоместитьФайлВХранилищеПоСсылке(АдресХранилища, ПутьТОРГ12);	
	ПолучитьФайл(АдресХранилища,"Торг12.pdf", Истина);
КонецПроцедуры

&НаСервере
Процедура ОтправитьПоПочтеНаСервере(АдресПолучателя)
	стрВложения = Новый Структура;
	Если Не ПустаяСтрока(ПутьСчет) Тогда
		стрВложения.Вставить("СчетНаОплату", ПутьСчет);
	КонецЕсли;
	Если Не ПустаяСтрока(ПутьАкт) Тогда
		стрВложения.Вставить("Акт", ПутьАкт);
	КонецЕсли;
	Если Не ПустаяСтрока(ПутьТОРГ12) Тогда
		стрВложения.Вставить("Торг12", ПутьТОРГ12);
	КонецЕсли;
	Если Не ПустаяСтрока(ПутьСФ) Тогда
		стрВложения.Вставить("СчетФактура", ПутьСФ);
	КонецЕсли;
	булУспешно = РаботаСЭлектроннойПочтойСервер.ОтправитьПочтовоеСообщение("Документ по счету №" + СчетПокупателя.Номер,,АдресПолучателя,,стрВложения);
	Если булУспешно Тогда
		Сообщить("Документы отправлены");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПоПочте(Команда)
	Оповещение = Новый ОписаниеОповещения("ОповещениеЗакрытиеФормыВВодаПолучателейЭлектронногоПисьма", ЭтотОбъект);
	Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	ОткрытьФорму("ОбщаяФорма.ФормаЗаполненияПолучателейЭлектронногоПписьма",,ЭтаФорма,,,,Оповещение,Режим);
	
	//АдресПолучателя = "";
	//Если ВвестиСтроку(АдресПолучателя, "Укажите адрес получателя") Тогда
	//	Если Не ПустаяСтрока(АдресПолучателя) Тогда
	//		ОтправитьПоПочтеНаСервере(АдресПолучателя);	
	//	КонецЕсли;
	//КонецЕсли;		                                           
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеЗакрытиеФормыВВодаПолучателейЭлектронногоПисьма(Результат, ДополнительныеПараметры) Экспорт 
	Если Результат = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	ОтправитьПоПочтеНаСервере(Результат);	

КонецПроцедуры // ОповещениеЗакрытиеФормыВВодаПолучателейЭлектронногоПисьма()


&НаСервере
Процедура ПереформироватьДокументыНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ПереформироватьДокументы(Команда)
	ПереформироватьДокументыНаСервере();
КонецПроцедуры

