
&НаКлиенте
Процедура ВзятьНаИсполнение(Команда)
	Объект.Исполнитель = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеПараметраСеанса("ТекущийПользователь");
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	Записать();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПередВыполнением(Отказ)
	Если Не ЗначениеЗаполнено(Объект.Комментарий) Тогда
		//Сообщить("Перед выполнение необходимо заполнить комментарий!", СтатусСообщения.Важное);
		ПоказатьОповещениеПользователя("Ошибка!",,"Перед выполнение необходимо заполнить комментарий!", БиблиотекаКартинок.Сервис);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		ЗаполнитьНовыйОбъектСервер();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНовыйОбъектСервер()
	Объект.Куратор = ПараметрыСеанса.ТекущийПользователь;
	Объект.Исполнитель = ПараметрыСеанса.ТекущийПользователь; 
КонецПроцедуры
