
&НаКлиенте
Процедура ТабельРабочегоВремениДеньНеделиПриИзменении(Элемент)
	РассчетСуммыПоСтрокеКлиент();
КонецПроцедуры

&НаКлиенте
Функция ВремяВведеноКорректноКлиент(ТекСтрока)
	ЗначениеВозврата = Истина;
	Если ТекСтрока.ВремяОкончания < ТекСтрока.ВремяНачала Тогда 
		Сообщить("Время окончания не может быть меньше времени начала!", СтатусСообщения.Важное);
		ТекСтрока.Сумма = Неопределено;
		ЗначениеВозврата = Ложь;
	КонецЕсли;
	Возврат ЗначениеВозврата;
КонецФункции

&НаСервере
Процедура РаспределитьСтрокивТабличнойЧастиПоРабочемуВремениСервер()
	ТаблицаДанных = Объект.ТабельРабочегоВремени.Выгрузить();
	УправлениеРабочимВременем.РаздробитьСтрокиКТЗНаРабочиеЧасы(ТаблицаДанных, Объект.КомпенсироватьТолькоПереработки, Объект.Дата);
	Объект.ТабельРабочегоВремени.Загрузить(ТаблицаДанных);
	//ЗначениеВРеквизитФормы(ТаблицаДанных, "Объект.ТабельРабочегоВремени");
КонецПроцедуры

&НаКлиенте
Процедура РассчетСуммыПоСтрокеКлиент()
	НачалоРабДня = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеКонстанты("ПерсоналНачалоРабочегоДня");
	КонецРабДня = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеКонстанты("ПерсоналОкончаниеРабочегоДня");
	ТекСтрока = Элементы.ТабельРабочегоВремени.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат
	КонецЕсли;
	Если Не ВремяВведеноКорректноКлиент(ТекСтрока) Тогда
		Возврат	
	КонецЕсли;
	//Если УправлениеРабочимВременем.НеобходимоРаспределитьСтрокуКлиент(ТекСтрока.ДеньНедели, ТекСтрока.ВремяНачала, ТекСтрока.ВремяОкончания) Тогда
		РаспределитьСтрокивТабличнойЧастиПоРабочемуВремениСервер();	
	//КонецЕсли;
	
	//Для Каждого СтрокаРВ ИЗ Объект.ТабельРабочегоВремени Цикл 	
	//	стрПараметры = Новый Структура;
	//	стрПараметры.Вставить("ДеньНедели", СтрокаРВ.ДеньНедели); 
	//	стрПараметры.Вставить("ВремяОкончания", СтрокаРВ.ВремяОкончания); 
	//	стрПараметры.Вставить("ВремяНачала", СтрокаРВ.ВремяНачала); 
	//	Сумма = РассчетСуммыПоСтрокеСервер(стрПараметры);
	//	СтрокаРВ.Сумма = Сумма; 
	//	Если Объект.КомпенсироватьТолькоПереработки 
	//		И Не (СтрокаРВ.ДеньНедели = ПредопределенноеЗначение("Перечисление.ДниНедели.Суббота") 
	//			ИЛИ СтрокаРВ.ДеньНедели = ПредопределенноеЗначение("Перечисление.ДниНедели.Воскресенье"))Тогда
	//		Если СтрокаРВ.ВремяНачала < НачалоРабДня ИЛИ  СтрокаРВ.ВремяОкончания > КонецРабДня Тогда
	//			СтрокаРВ.ВНачисление = Истина;
	//		Иначе
	//			СтрокаРВ.ВНачисление = Ложь;
	//		КонецЕсли;				
	//	Иначе
	//		СтрокаРВ.ВНачисление = Истина;		
	//	КонецЕсли;
	//	СтрокаРВ.Количество = (СтрокаРВ.ВремяОкончания - СтрокаРВ.ВремяНачала) / 3600; 
	//	Если СтрокаРВ.Количество = 0 Тогда 
	//		СтрокаРВ.Цена = 0;
	//	Иначе
	//		СтрокаРВ.Цена = СтрокаРВ.Сумма / СтрокаРВ.Количество;
	//	КонецЕсли;
	//КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТабельРабочегоВремениВремяНачалаПриИзменении(Элемент)
	РассчетСуммыПоСтрокеКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ТабельРабочегоВремениВремяОкончанияПриИзменении(Элемент)
	РассчетСуммыПоСтрокеКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.СуммаДокумента = Объект.ТабельРабочегоВремени.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТабельРабочегоВремениДатаПриИзменении(Элемент)
	ТекСтрока = Элементы.ТабельРабочегоВремени.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат
	КонецЕсли;
	ТекСтрока.ДеньНедели = УправлениеРабочимВременем.ПолучитьДеньНеделиПоДате(ТекСтрока.Дата);
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	Объект.КомпенсироватьТолькоПереработки = ОбщегоНазначения.ПолучитьЗначениРеквизитаОбъекта(Объект.Сотрудник, "КомпенсироватьТолькоПереработки");
	РассчетСуммыПоСтрокеКлиент();	
КонецПроцедуры

&НаКлиенте
Процедура КомпенсироватьТолькоПереработкиПриИзменении(Элемент)
	РассчетСуммыПоСтрокеКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	РаботаСФормамиКлиент.ОповеститьПослеЗаписиФормы("ЗаписьНаФорме", Объект.Ссылка, Новый Структура("Проект", Объект.Проект));
КонецПроцедуры

&НаКлиенте
Процедура ТабельРабочегоВремениКоличествоПриИзменении(Элемент)
	Элементы.ТабельРабочегоВремени.ТекущиеДанные.Сумма = Элементы.ТабельРабочегоВремени.ТекущиеДанные.Цена * Элементы.ТабельРабочегоВремени.ТекущиеДанные.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ТабельРабочегоВремениЦенаПриИзменении(Элемент)
	Элементы.ТабельРабочегоВремени.ТекущиеДанные.Сумма = Элементы.ТабельРабочегоВремени.ТекущиеДанные.Цена * Элементы.ТабельРабочегоВремени.ТекущиеДанные.Количество;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьУсловноеОформлениеСервер();
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеСервер()
	Если Объект.Согласовано И Не РольДоступна("ПолныеПрава") Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;	
	КонецЕсли;		
КонецПроцедуры
