
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СтоимостьРабочегоВремени
	Движения.СтоимостьРабочегоВремени.Записывать = Истина;
	Для Каждого ТекСтрокаВремяРаботы Из ВремяРаботы Цикл
		Движение = Движения.СтоимостьРабочегоВремени.Добавить();
		Движение.Период = Дата;
		Движение.ДеньНедели = ТекСтрокаВремяРаботы.ДеньНедели;
		Движение.ВремяНачала = ТекСтрокаВремяРаботы.ВремНачала;
		Движение.ВремяОкончания = ТекСтрокаВремяРаботы.ВремОкончания;
		Движение.Стоимость = ТекСтрокаВремяРаботы.Стоимость;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
