Процедура УстановитьПараметрСеансаТекущийПользователь() Экспорт 
	ТекПользовательПлатформы = ПользователиИнформационнойБазы.ТекущийПользователь(); 
	ИдентификаторПользователя = ТекПользовательПлатформы.УникальныйИдентификатор;
	
	ПользовательВБазе = Справочники.Пользователи.НайтиПоРеквизиту("УИД", ИдентификаторПользователя);
	Если ПользовательВБазе = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка") Тогда
		НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
		НовыйПользователь.Наименование = ТекПользовательПлатформы.Имя;
		НовыйПользователь.УИД = ИдентификаторПользователя;
		НовыйПользователь.Записать();
		ПользовательВБазе = НовыйПользователь.Ссылка; 	
	КонецЕсли;
		
	ПараметрыСеанса.ТекущийПользователь = ПользовательВБазе;	

КонецПроцедуры
