Перем ИмпортИЗFM Экспорт;  

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПрибыльПоПроектам Приход
	Движения.ПрибыльПоПроектам.Записывать = Истина;
	Если Оплачен И ЗначениеЗаполнено(Проект) Тогда
		//Движения.ПрибыльПоПроектам.Записывать = Истина;
		Движение = Движения.ПрибыльПоПроектам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Проект = Проект;
		Движение.Сумма = СуммаДокумента;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Ссылка.Пустая() Тогда
		ЗаполнениеНовогоДокумента();	
	КонецЕсли;
	СуммаДокумента = Товары.Итог("Сумма");
	//ИнтеграцияСFMСервер.СинхронизироватьСчетПокупателяСFM(ЭтотОбъект);
КонецПроцедуры

Процедура ЗаполнитьПоЗаказуПоставщика(ДанныеЗаполнения)
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,,"Контрагент, Номер, Дата");
	Для Каждого СтрокаТовар ИЗ ДанныеЗаполнения.Товары Цикл 
		НовыйТовар = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйТовар, СтрокаТовар);
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьПоЗаказуПроекту(ДанныеЗаполнения)
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,,"Контрагент, Номер, Дата");
	Для Каждого СтрокаТовар ИЗ ДанныеЗаполнения.Товары Цикл 
		НовыйТовар = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйТовар, СтрокаТовар);
	КонецЦикла;
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетПоставщика") Тогда
		ЗаполнитьПоЗаказуПоставщика(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Проекты") Тогда
 	    ЗаполнениеДокументовСервер.ЗаполнитьОбъектПоПроекту(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнениеНовогоДокумента()
	Если Не ЗначениеЗаполнено(СостояниеДокументов) Тогда
		СостояниеДокументов = Перечисления.СтатусыПодготовкиДокументов.НеСформированы;
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	НомерFM = Неопределено;
КонецПроцедуры

ИмпортИЗFM = Ложь;