
Функция telegramМетод1(Запрос)
	
	Ответ = ИнтеграцияСTelegramСервер.ОбработатьЗапросТелеграм(Запрос);
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("Hello World!");
	СтрокаЗапросЗаголовки = ЗначениеВСтрокуВнутр(Запрос.Заголовки);
	СтрокаЗапросТело =Запрос.ПолучитьТелоКакСтроку();
	ТекДок = Новый ТекстовыйДокумент;
	ТекДок.УстановитьТекст(СтрокаЗапросЗаголовки + Символы.ПС + "Тело: " + СтрокаЗапросТело);
	ТекДок.Записать("C:\temp\queries\" + Формат(ТекущаяДата(), "ДФ=yyyyMMddhhss") + ".txt"); 
	Возврат Ответ;
КонецФункции
