Функция ПолучитьЗначениеКонстанты(ИмяКонстанты) Экспорт 
	Возврат Константы[ИмяКонстанты].Получить();
КонецФункции

Функция ПолучитьТекущегоСотрудника() Экспорт 
	Возврат ПараметрыСеанса.ТекущийПользователь.Сотрудник;
КонецФункции

Функция ПолучитьЗначениеПараметраСеанса(ИмяПараметра) Экспорт 
	Возврат ПараметрыСеанса[ИмяПараметра];
КонецФункции

Функция ПроверитьДоступностьРоли(ИмяРоли) Экспорт 
	Возврат РольДоступна(ИмяРоли);
КонецФункции

Функция ПолучитьСтрокуСоединенияFM(Организация) Экспорт 
	Возврат Организация.СтрокаПодключенияFM;	
КонецФункции

Функция ПолучитьСтрокуСоединенияБухгалтерия(Организация) Экспорт 
	Возврат Организация.СтрокаПодключенияБухгалтерия;	
КонецФункции

Функция ПолучитьЗначениеСправочникаПОКоду(Справочник, КодЭлемента) Экспорт
	Возврат Справочники[Справочник].НайтиПоКоду(КодЭлемента);	
КонецФункции