Процедура ЗагрузитьФайлНаСервере(АдресФайла, ВыбранноеИмяФайла, СсылкаОбъект) Экспорт 
	Если АдресФайла = Неопределено Тогда
		Возврат	
	КонецЕсли;
	
	Файл = Новый Файл(ВыбранноеИмяФайла);
	ИмяФайла = Файл.Имя;
	Расширение = Файл.Расширение;
	НовыйЭлемент = Справочники.ХранилищеПрикрепленныхФайлов.СоздатьЭлемент();
	НовыйЭлемент.Объект = СсылкаОбъект; 
	НовыйЭлемент.Наименование = ТекущаяДата();
	НовыйЭлемент.ИмяФайла = ИмяФайла;
	НовыйЭлемент.Расширение = Расширение;
	НовыйЭлемент.Хранилище = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресФайла), Новый СжатиеДанных(9));
	Попытка
		НовыйЭлемент.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());	
	КонецПопытки;
КонецПроцедуры
