Функция СоздатьОбновитьДокументРабочееВремя(стрПараметры) Экспорт 
	ДокументОбъект = Документы.РабочееВремя.СоздатьДокумент();
	ДокументОбъект.Дата = ТекущаяДата();
	ДокументОбъект.Сотрудник = стрПараметры.Сотрудник;//ПараметрыСеанса.ТекущийПользователь.Сотрудник;
	ДокументОбъект.Проект = стрПараметры.Проект;
	ДокументОбъект.Согласовано = Ложь;
	ДокументОбъект.Комментарий = стрПараметры.Комментарий;
	//ДокументОбъект.ТСД = ссылкаТСД; 
	
	ДокументОбъект.КомпенсироватьТолькоПереработки = стрПараметры.Сотрудник.КомпенсироватьТолькоПереработки;	
	ДокументОбъект.ТабельРабочегоВремени.Очистить();
	НоваяСтрокаРабВремя = ДокументОбъект.ТабельРабочегоВремени.Добавить();
	НоваяСтрокаРабВремя.Дата = ТекущаяДата();
	НоваяСтрокаРабВремя.ДеньНедели = УправлениеРабочимВременем.ПолучитьДеньНеделиПоДате(НоваяСтрокаРабВремя.Дата);
	НоваяСтрокаРабВремя.ВремяНачала = стрПараметры.ВремяНачала;	
	НоваяСтрокаРабВремя.ВремяОкончания = стрПараметры.ВремяОкончания;

	ТаблицаДанных = ДокументОбъект.ТабельРабочегоВремени.Выгрузить();
	УправлениеРабочимВременем.РаздробитьСтрокиКТЗНаРабочиеЧасы(ТаблицаДанных, ДокументОбъект.КомпенсироватьТолькоПереработки, ДокументОбъект.Дата);
	ДокументОбъект.ТабельРабочегоВремени.Загрузить(ТаблицаДанных);
	Если стрПараметры.Свойство("КоординатыНачала") Тогда
		ДобавитьСтрокуКоординат(ДокументОбъект.Координаты, стрПараметры.КоординатыНачала);		
	КонецЕсли;
	Если стрПараметры.Свойство("КоординатыЗавершения") Тогда
		ДобавитьСтрокуКоординат(ДокументОбъект.Координаты, стрПараметры.КоординатыЗавершения);		
	КонецЕсли;

	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Возврат ДокументОбъект.Ссылка;
КонецФункции

Процедура ДобавитьСтрокуКоординат(КоординатыТЧ, стрЗаполнение)
	НоваяСтрока = КоординатыТЧ.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, стрЗаполнение);
	//НоваяСтрока
КонецПроцедуры
