
&НаСервере
Функция ОткрытьФайлНаСервере(Ссылка)
	ИмяФайла = Ссылка.ИмяФайла;
	АдресХранилища = ПоместитьВоВременноеХранилище(Ссылка.Хранилище.Получить(), УникальныйИдентификатор);
	Возврат новый Структура("ИмяФайла, АдресХранилища", ИмяФайла, АдресХранилища);
КонецФункции

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат
	КонецЕсли;
	стрФайл = ОткрытьФайлНаСервере(ТекСтрока.Ссылка);
	ИмяФайла = стрФайл.ИмяФайла;
	АдресХранилища = стрФайл.АдресХранилища; 
	ПолучитьФайл(АдресХранилища, ИмяФайла, Истина);	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("Объект", Параметры.Объект);
	Объект = Параметры.Объект;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьФайлНаСервере(АдресФайла, ВыбранноеИмяФайла)
	Если АдресФайла = Неопределено Тогда
		Возврат	
	КонецЕсли;
	
	Файл = Новый Файл(ВыбранноеИмяФайла);
	ИмяФайла = Файл.Имя;
	Расширение = Файл.Расширение;
	НовыйЭлемент = Справочники.ХранилищеПрикрепленныхФайлов.СоздатьЭлемент();
	НовыйЭлемент.Объект = Объект; 
	НовыйЭлемент.Наименование = ИмяФайла;
	НовыйЭлемент.ИмяФайла = ИмяФайла;
	НовыйЭлемент.Расширение = Расширение;
	НовыйЭлемент.Хранилище = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресФайла), Новый СжатиеДанных(9));
	НовыйЭлемент.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	Перем ВыбранноеИмяФайла, АдресФайла;
	ПоместитьФайл(АдресФайла,,ВыбранноеИмяФайла, Истина, УникальныйИдентификатор);
	ЗагрузитьФайлНаСервере(АдресФайла, ВыбранноеИмяФайла);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьИзШаблона(Команда)
	СписокШаблонов = НОвый СписокЗначений;
	СписокШаблонов.Добавить("Документ.ЗаявкаНаТендер.ПФ_MXL_ОсновнаяСтраницаТендера", "Приложение");
	СписокШаблонов.Добавить("Документ.ЗаявкаНаТендер.ПФ_MXL_ТоварыДляТендера", "Приложение товары");
	СписокШаблонов.Добавить("", "Пустой макет");
	ВыбранныйШаблон = СписокШаблонов.ВыбратьЭлемент("Выберите шаблон для создания");
	Если ВыбранныйШаблон = Неопределено Тогда
		Возврат
	КонецЕсли;
	Если Не ПустаяСтрока(ВыбранныйШаблон.Значение) Тогда
		ТабДок =  УправлениеПечатью.МакетПечатнойФормы(ВыбранныйШаблон.Значение);
	Иначе
		ТабДок = Новый ТабличныйДокумент;	
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("ОповещениеЗакрытиеФормыРедактированиеТабличногоДокумента", ЭтотОбъект);
	стрПараметры = Новый Структура;
	стрПараметры.Вставить("ТабличныйДокумент", ТабДок);
	стрПараметры.Вставить("Редактирование", Истина);
	стрПараметры.Вставить("ИмяОбъектаМетаданныхМакета", ВыбранныйШаблон.Представление);  
	стрПараметры.Вставить("ИмяДокумента", ВыбранныйШаблон.Представление);
	стрПараметры.Вставить("ОбъектВладелец", Объект);
	//Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	ОткрытьФорму("ОбщаяФорма.РедактированиеТабличногоДокумента", стрПараметры, ЭтаФорма, УникальныйИдентификатор,,, Оповещение);
КонецПроцедуры

&НаСервере
Процедура СписокВыборНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСтрока = Элементы.Список.ТекущиеДанные;	
	ТабДокМакета = УправлениеПечатью.ПОлучитьТабДокПользовательскогоМакета(ТекСтрока.ИмяМакета, Объект);
	Если ТабДокМакета = Неопределено Тогда
		Сообщить("НЕ удалось получить макет для объекта " + Объект, СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ОповещениеЗакрытиеФормыРедактированиеТабличногоДокумента", ЭтотОбъект);
	стрПараметры = Новый Структура;
	стрПараметры.Вставить("ТабличныйДокумент", ТабДокМакета);
	стрПараметры.Вставить("РедактированиеСтарогоМакета", Истина);
	стрПараметры.Вставить("Редактирование", Истина);
	стрПараметры.Вставить("ИмяОбъектаМетаданныхМакета", ТекСтрока.ИмяМакета);  
	стрПараметры.Вставить("ИмяДокумента", ТекСтрока.ИмяМакета);
	стрПараметры.Вставить("ОбъектВладелец", Объект);
	//Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	ОткрытьФорму("ОбщаяФорма.РедактированиеТабличногоДокумента", стрПараметры, ЭтаФорма, УникальныйИдентификатор,,, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеЗакрытиеФормыРедактированиеТабличногоДокумента(РезультатФормы, ДополнительныеПараметры) Экспорт 
	Элементы.Список.Обновить();
КонецПроцедуры
